first_routes/app/controllers/artworks_controller.rb

INSERT INTO "artworks" ("title", "img_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "'Bad Art'"], ["img_url", "'bad_art.jpg'"], ["artist_id", 9], ["created_at", "2020-01-02 21:24:43.071265"], ["updated_at", "2020-01-02 21:24:43.071265"]]
---
    def create
        artwork = Artwork.new(artwork_params)

        if artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "img_url" = $2, "updated_at" = $3 WHERE "artworks"."id" = $4  [["title", "Decent Art"], ["img_url", "decent_art.jpg"], ["updated_at", "2020-01-02 21:26:11.434543"], ["id", 14]]
---
    def update
        artwork = Artwork.find(params[:id])

        if artwork.update(artwork_params)

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 14]]
---
    def destroy
        artwork = Artwork.find(params[:id])

        if artwork.destroy