first_routes/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "username") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2020-01-02 20:36:16.889140"], ["updated_at", "2020-01-02 20:36:16.889140"], ["username", "Oliver"]]
---
    def create
        user = User.new(user_params)

        if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "STEVED"], ["updated_at", "2020-01-02 20:46:03.383572"], ["id", 5]]
---
    def update
        user = User.find(params[:id])

        if user.update(user_params)